bdshields/mini_tetris/msp430f1611.svd
<?xml version="1.0" encoding="UTF-8"?><device><name>MSP430F1611</name><size>2</size><resetValue>0</resetValue><access>read-write</access><peripherals><peripheral><name>SPECIAL_FUNCTION</name><description>Special Function</description><baseAddress>0</baseAddress><registers><register><name>IE1</name><description>Interrupt Enable 1</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>WDTIE</name><description>WDTIE</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OFIE</name><description>OFIE</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NMIIE</name><description>NMIIE</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ACCVIE</name><description>ACCVIE</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXIE0</name><description>URXIE0</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXIE0</name><description>UTXIE0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>IE2</name><description>Interrupt Enable 2</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>URXIE1</name><description>URXIE1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXIE1</name><description>UTXIE1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>IFG1</name><description>Interrupt Flag 1</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>WDTIFG</name><description>WDTIFG</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OFIFG</name><description>OFIFG</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NMIIFG</name><description>NMIIFG</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXIFG0</name><description>URXIFG0</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXIFG0</name><description>UTXIFG0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>IFG2</name><description>Interrupt Flag 2</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>URXIFG1</name><description>URXIFG1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXIFG1</name><description>UTXIFG1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ME1</name><description>Module Enable 1</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>URXE0</name><description>URXE0</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXE0</name><description>UTXE0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ME2</name><description>Module Enable 2</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>URXE1</name><description>URXE1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UTXE1</name><description>UTXE1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>PORT_3_4</name><description>Port 3/4</description><baseAddress>24</baseAddress><registers><register><name>P3IN</name><description>Port 3 Input</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3OUT</name><description>Port 3 Output</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3DIR</name><description>Port 3 Direction</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P3SEL</name><description>Port 3 Selection</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P4IN</name><description>Port 4 Input</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P4OUT</name><description>Port 4 Output</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P4DIR</name><description>Port 4 Direction</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P4SEL</name><description>Port 4 Selection</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>PORT_1_2</name><description>Port 1/2</description><baseAddress>32</baseAddress><registers><register><name>P1IN</name><description>Port 1 Input</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1OUT</name><description>Port 1 Output</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1DIR</name><description>Port 1 Direction</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IFG</name><description>Port 1 Interrupt Flag</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IES</name><description>Port 1 Interrupt Edge Select</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1IE</name><description>Port 1 Interrupt Enable</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P1SEL</name><description>Port 1 Selection</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register