bdshields/mini_tetris/msp430f1611.svd
><name>P2IN</name><description>Port 2 Input</description><addressOffset>8</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2OUT</name><description>Port 2 Output</description><addressOffset>9</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2DIR</name><description>Port 2 Direction</description><addressOffset>10</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IFG</name><description>Port 2 Interrupt Flag</description><addressOffset>11</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IES</name><description>Port 2 Interrupt Edge Select</description><addressOffset>12</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2IE</name><description>Port 2 Interrupt Enable</description><addressOffset>13</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P2SEL</name><description>Port 2 Selection</description><addressOffset>14</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>PORT_5_6</name><description>Port 5/6</description><baseAddress>48</baseAddress><registers><register><name>P5IN</name><description>Port 5 Input</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P5OUT</name><description>Port 5 Output</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P5DIR</name><description>Port 5 Direction</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P5SEL</name><description>Port 5 Selection</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P6IN</name><description>Port 6 Input</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P6OUT</name><description>Port 6 Output</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P6DIR</name><description>Port 6 Direction</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>P6SEL</name><description>Port 6 Selection</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>P0</name><description>P0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P1</name><description>P1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2</name><description>P2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P3</name><description>P3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P4</name><description>P4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P5</name><description>P5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P6</name><description>P6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P7</name><description>P7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>USART_0_I2C_MODE</name><description>USART 0  I2C Mode</description><baseAddress>80</baseAddress><registers><register><name>I2CIE</name><description>I2C Interrupt Enable</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>ALIE</name><description>Arbitration lost</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NACKIE</name><description>No acknowledge</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OAIE</name><description>Own address</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARDYIE</name><description>Access ready (opeation complete)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXRDYIE</name><description>Receive ready (data received)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXRDYIE</name><description>Transmit ready (transmit register empty)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GCIE</name><description>General call</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STTIE</name><description>Start condition</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>I2CIFG</name><description>I2C Interrupt Flag</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>ALIFG</name><description>Arbitration lost</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NACKIFG</name><description>No acknowledge</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OAIFG</name><description>Own address</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARDYIFG</name><description>Access ready (opeation complete)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXRDYIFG</name><description>Receive ready (data received)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXRDYIFG</name><description>Transmit ready (transmit register empty)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GCIFG</name><description>General call</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STTIFG</name><description>Start condition</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>I2CNDAT</name><description>I2C Data Count</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U0CTL_I2C</name><description>USART 0 Control I2C</description><addressOffset>32</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>I2CEN</name><description>I2C enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MST</name><description>I2C master</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYNC</name><description>USART synchronous/asynchronous</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LISTEN</name><description>Loopback</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XA</name><