bdshields/mini_tetris/msp430f1611.svd
description>I2C extended addressing</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C</name><description>USART I2C</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXDMAEN</name><description>Transmit DMA enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXDMAEN</name><description>Receive DMA enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>I2CTCTL</name><description>I2C Transfer Control</description><addressOffset>33</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>I2CSTT</name><description>Start bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CSTP</name><description>Stop bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CSTB</name><description>Start byte mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CTRX</name><description>Transmit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CSSEL</name><description>Clock select bit 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>I2CSSEL_0</name><description>I2C clock select 0: UCLK</description><value>0</value></enumeratedValue><enumeratedValue><name>I2CSSEL_1</name><description>I2C clock select 1: ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>I2CSSEL_2</name><description>I2C clock select 2: SMCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>I2CSSEL_3</name><description>I2C clock select 3: SMCLK</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>I2CRM</name><description>Repeat mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CWORD</name><description>Word data mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>I2CDCTL</name><description>I2C Data Control</description><addressOffset>34</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>I2CBB</name><description>Bus busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CRXOVR</name><description>Receiver overrun</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CTXUDF</name><description>Transmit underflow</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CSBD</name><description>Received byte</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CSCLLOW</name><description>SCL being held low</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2CBUSY</name><description>I2C Busy Flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>I2CPSC</name><description>I2C Pre-scaler</description><addressOffset>35</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>I2CSCLH</name><description>I2C SCL High</description><addressOffset>36</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>I2CSCLL</name><description>I2C SCL Low</description><addressOffset>37</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>I2CDRB</name><description>I2C Data for Byte access</description><addressOffset>38</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>I2COA</name><description>I2C Own Address</description><addressOffset>200</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>I2CSA</name><description>I2C Slave Address</description><addressOffset>202</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>I2CIV</name><description>I2C Interrupt Vector</description><addressOffset>204</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>SUPPLY_VOLTAGE_SUPERVISOR</name><description>Supply Voltage Supervisor</description><baseAddress>84</baseAddress><registers><register><name>SVSCTL</name><description>SVS Control</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>SVSFG</name><description>SVS Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SVSOP</name><description>SVS output (read only)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SVSON</name><description>Switches the SVS on/off</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORON</name><description>Enable POR Generation if Low Voltage</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VLD0</name><description>VLD0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VLD1</name><description>VLD1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VLD2</name><description>VLD2</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VLD3</name><description>VLD3</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>SYSTEM_CLOCK</name><description>System Clock</description><baseAddress>86</baseAddress><registers><register><name>DCOCTL</name><description>DCO Clock Frequency Control</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>MOD0</name><description>Modulation Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MOD1</name><description>Modulation Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MOD2</name><description>Modulation Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MOD3</name><description>Modulation Bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MOD4</name><description>Modulation Bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCO0</name><description>DCO Select Bit 0</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCO1</name><description>DCO Select Bit 1</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DCO2</name><description>DCO Select Bit 2</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>BCSCTL1</name><description>Basic Clock System Control 1</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>RSEL0</name><description>Range Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RSEL1</name><description>Range Select Bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RSEL2</name><description>Range Select Bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XT5V</name><description>XT5V should always be reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIVA</name><description>ACLK Divider 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DIVA_0</name><description>ACLK Divider 0: /1</description><value>0</value></enumeratedValue><enumeratedValue><name>DIVA_1</name><description>ACLK Divider 1: /2</description><value>1</value></enumeratedValue><enumeratedValue><name>DIVA_2</name><description>ACLK Divider 2: /4</description><value>2</value></enumeratedValue><enumeratedValue><name>DIVA_3</name><description>ACLK Divider 3: /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>XTS</name><description>LFXTCLK 0:Low Freq. / 1: High Freq.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>XT2OFF</name><description>Enable XT2CLK</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>BCSCTL2</name><description>Basic Clock System Control 2</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>DCOR</name><description>Enable External Resistor : 1</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIVS</name><description>SMCLK Divider 0</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DIVS_0</name><description>SMCLK Divider 0: /1</description><value>0</value></enumeratedValue><enumeratedValue><name>DIVS_1</name><description>SMCLK Divider 1: /2</description><value>1</value></enumeratedValue><enumeratedValue><name>DIVS_2</name><description>SMCLK Divider 2: /4</description><value>2</value></enumeratedValue><enumeratedValue><name>DIVS_3</name><description>SMCLK Divider 3: /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SELS</name><description>SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DIVM</name><description>MCLK Divider 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DIVM_0</name><description>MCLK Divider 0: /1</description><value>0</value></enumeratedValue><enumeratedValue><name>DIVM_1</name><description>MCLK Divider 1: /2</description><value>1</value></enumeratedValue><enumeratedValue><name>DIVM_2</name><description>MCLK Divider 2: /4</description><value>2</value></enumeratedValue><enumeratedValue><name>DIVM_3</name><description>MCLK Divider 3: /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SELM</name><description>MCLK Source Select 0</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SELM_0</name><description>MCLK Source Select 0: DCOCLK</description><value>0</value></enumeratedValue><enumeratedValue><name>SELM_1</name><description>MCLK Source Select 1: DCOCLK</description><value>1</value></enumeratedValue><enumeratedValue><name>SELM_2</name><description>MCLK Source Select 2: XT2CLK/LFXTCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>SELM_3</name><description>MCLK Source Select 3: LFXTCLK</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register></registers></peripheral><peripheral><name>COMPARATOR_A</name><description>Comparator A</description><baseAddress>88</baseAddress><registers><register><name>CACTL1</name><description>Comparator A Control 1</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>CAIFG</name><description>Comp. A Interrupt Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAIE</name><description>Comp. A Interrupt Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAIES</name><description>Comp. A Int. Edge Select: 0:rising / 1:falling</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAON</name><description>Comp. A enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAREF</name><description>Comp. A Internal Reference Select 0</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CAREF_0</name><description>Comp. A Int. Ref. Select 0 : Off</description><value>0</value></enumeratedValue><enumeratedValue><name>CAREF_1</name><description>Comp. A Int. Ref. Select 1 : 0.25*Vcc</description><value>1</value></enumeratedValue><enumeratedValue><name>CAREF_2</name><description>Comp. A Int. Ref. Select 2 : 0.5*Vcc</description><value>2</value></enumeratedValue><enumeratedValue><name>CAREF_3</name><description>Comp. A Int. Ref. Select 3 : Vt</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CARSEL</name><description>Comp. A Internal Reference Enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAEX</name><description>Comp. A Exchange Inputs</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CACTL2</name><description>Comparator A Control 2</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>CAOUT</name><description>Comp. A Output</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAF</name><description>Comp. A Enable Output Filter</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2CA0</name><description>Comp. A Connect External Signal to CA0 : 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>P2CA1</name><description>Comp. A Connect External Signal to CA1 : 1</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CACTL24</name><description>CACTL24</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CACTL25</name><description>CACTL25</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CACTL26</name><description>CACTL26</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CACTL27</name><description>CACTL27</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>CAPD</name><description>Comparator A Port Disable</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>CAPD0</name><description>Comp. A Disable Input Buffer of Port Register .0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD1</name><description>Comp. A Disable Input Buffer of Port Register .1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD2</name><description>Comp. A Disable Input Buffer of Port Register .2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD3</name><description>Comp. A Disable Input Buffer of Port Register .3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD4</name><description>Comp. A Disable Input Buffer of Port Register .4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD5</name><description>Comp. A Disable Input Buffer of Port Register .5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD6</name><description>Comp. A Disable Input Buffer of Port Register .6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAPD7</name><description>Comp. A Disable Input Buffer of Port Register .7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register></registers></peripheral><peripheral><name>USART_0_UART_SPI_MODE</name><description>USART 0  UART/SPI Mode</description><baseAddress>112</baseAddress><registers><register><name>U0CTL</name><description>USART 0 Control</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>SWRST</name><description>USART Software Reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MM</name><description>Master Mode off/on</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYNC</name><description>UART / SPI mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LISTEN</name><description>Listen mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHAR</name><description>Data 0:7-bits / 1:8-bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPB</name><description>Stop Bits 0:one / 1: two</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PEV</name><description>Parity 0:odd / 1:even</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PENA</name><description>Parity enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U0TCTL</name><description>USART 0 Transmit Control</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>TXEPT</name><description>TX Buffer empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STC</name><description>SPI: STC enable 0:on / 1:off</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXWAKE</name><description>TX Wake up mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXSE</name><description>Receive Start edge select</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSEL0</name><description>Clock Source Select 0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSEL1</name><description>Clock Source Select 1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CKPL</name><description>Clock Polarity</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CKPH</name><description>SPI: Clock Phase</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U0RCTL</name><description>USART 0 Receive Control</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>RXERR</name><description>RX Error Error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXWAKE</name><description>RX Wake up detect</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXWIE</name><description>RX Wake up interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXEIE</name><description>RX Error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BRK</name><description>Break detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OE</name><description>Overrun Error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PE</name><description>Parity Error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FE</name><description>Frame Error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U0MCTL</name><description>USART 0 Modulation Control</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U0BR0</name><description>USART 0 Baud Rate 0</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U0BR1</name><description>USART 0 Baud Rate 1</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U0RXBUF</name><description>USART 0 Receive Buffer</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U0TXBUF</name><description>USART 0 Transmit Buffer</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask></register></registers></peripheral><peripheral><name>USART_1</name><description>USART 1</description><baseAddress>120</baseAddress><registers><register><name>U1CTL</name><description>USART 1 Control</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>SWRST</name><description>USART Software Reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MM</name><description>Master Mode off/on</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SYNC</name><description>UART / SPI mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LISTEN</name><description>Listen mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CHAR</name><description>Data 0:7-bits / 1:8-bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SPB</name><description>Stop Bits 0:one / 1: two</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PEV</name><description>Parity 0:odd / 1:even</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field>