bdshields/mini_tetris/msp430f1611.svd
<name>PENA</name><description>Parity enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U1TCTL</name><description>USART 1 Transmit Control</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>TXEPT</name><description>TX Buffer empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STC</name><description>SPI: STC enable 0:on / 1:off</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXWAKE</name><description>TX Wake up mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXSE</name><description>Receive Start edge select</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSEL0</name><description>Clock Source Select 0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SSEL1</name><description>Clock Source Select 1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CKPL</name><description>Clock Polarity</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CKPH</name><description>SPI: Clock Phase</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U1RCTL</name><description>USART 1 Receive Control</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>RXERR</name><description>RX Error Error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXWAKE</name><description>RX Wake up detect</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXWIE</name><description>RX Wake up interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>URXEIE</name><description>RX Error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BRK</name><description>Break detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OE</name><description>Overrun Error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PE</name><description>Parity Error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FE</name><description>Frame Error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint></register><register><name>U1MCTL</name><description>USART 1 Modulation Control</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U1BR0</name><description>USART 1 Baud Rate 0</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U1BR1</name><description>USART 1 Baud Rate 1</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U1RXBUF</name><description>USART 1 Receive Buffer</description><addressOffset>6</addressOffset><size>8</size><resetMask>255</resetMask></register><register><name>U1TXBUF</name><description>USART 1 Transmit Buffer</description><addressOffset>7</addressOffset><size>8</size><resetMask>255</resetMask></register></registers></peripheral><peripheral><name>ADC12</name><description>ADC12</description><baseAddress>128</baseAddress><registers><register><name>ADC12MCTL0</name><description>ADC12 Memory Control 0</description><addressOffset>0</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL1</name><description>ADC12 Memory Control 1</description><addressOffset>1</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL2</name><description>ADC12 Memory Control 2</description><addressOffset>2</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL3</name><description>ADC12 Memory Control 3</description><addressOffset>3</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL4</name><description>ADC12 Memory Control 4</description><addressOffset>4</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL5</name><description>ADC12 Memory Control 5</description><addressOffset>5</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</descript