bdshields/mini_tetris/msp430f1611.svd
<name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL13</name><description>ADC12 Memory Control 13</description><addressOffset>13</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL14</name><description>ADC12 Memory Control 14</description><addressOffset>14</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MCTL15</name><description>ADC12 Memory Control 15</description><addressOffset>15</addressOffset><size>8</size><resetMask>255</resetMask><fields><field><name>INCH</name><description>ADC12 Input Channel Select Bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>INCH_0</name><description>ADC12 Input Channel 0</description><value>0</value></enumeratedValue><enumeratedValue><name>INCH_1</name><description>ADC12 Input Channel 1</description><value>1</value></enumeratedValue><enumeratedValue><name>INCH_2</name><description>ADC12 Input Channel 2</description><value>2</value></enumeratedValue><enumeratedValue><name>INCH_3</name><description>ADC12 Input Channel 3</description><value>3</value></enumeratedValue><enumeratedValue><name>INCH_4</name><description>ADC12 Input Channel 4</description><value>4</value></enumeratedValue><enumeratedValue><name>INCH_5</name><description>ADC12 Input Channel 5</description><value>5</value></enumeratedValue><enumeratedValue><name>INCH_6</name><description>ADC12 Input Channel 6</description><value>6</value></enumeratedValue><enumeratedValue><name>INCH_7</name><description>ADC12 Input Channel 7</description><value>7</value></enumeratedValue><enumeratedValue><name>INCH_8</name><description>ADC12 Input Channel 8</description><value>8</value></enumeratedValue><enumeratedValue><name>INCH_9</name><description>ADC12 Input Channel 9</description><value>9</value></enumeratedValue><enumeratedValue><name>INCH_10</name><description>ADC12 Input Channel 10</description><value>10</value></enumeratedValue><enumeratedValue><name>INCH_11</name><description>ADC12 Input Channel 11</description><value>11</value></enumeratedValue><enumeratedValue><name>INCH_12</name><description>ADC12 Input Channel 12</description><value>12</value></enumeratedValue><enumeratedValue><name>INCH_13</name><description>ADC12 Input Channel 13</description><value>13</value></enumeratedValue><enumeratedValue><name>INCH_14</name><description>ADC12 Input Channel 14</description><value>14</value></enumeratedValue><enumeratedValue><name>INCH_15</name><description>ADC12 Input Channel 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SREF</name><description>ADC12 Select Reference Bit 0</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SREF_0</name><description>ADC12 Select Reference 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SREF_1</name><description>ADC12 Select Reference 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SREF_2</name><description>ADC12 Select Reference 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SREF_3</name><description>ADC12 Select Reference 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SREF_4</name><description>ADC12 Select Reference 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SREF_5</name><description>ADC12 Select Reference 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SREF_6</name><description>ADC12 Select Reference 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SREF_7</name><description>ADC12 Select Reference 7</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>EOS</name><description>ADC12 End of Sequence</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ADC12MEM0</name><description>ADC12 Conversion Memory 0</description><addressOffset>192</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM1</name><description>ADC12 Conversion Memory 1</description><addressOffset>194</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM2</name><description>ADC12 Conversion Memory 2</description><addressOffset>196</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM3</name><description>ADC12 Conversion Memory 3</description><addressOffset>198</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM4</name><description>ADC12 Conversion Memory 4</description><addressOffset>200</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM5</name><description>ADC12 Conversion Memory 5</description><addressOffset>202</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM6</name><description>ADC12 Conversion Memory 6</description><addressOffset>204</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM7</name><description>ADC12 Conversion Memory 7</description><addressOffset>206</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM8</name><description>ADC12 Conversion Memory 8</description><addressOffset>208</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM9</name><description>ADC12 Conversion Memory 9</description><addressOffset>210</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM10</name><description>ADC12 Conversion Memory 10</description><addressOffset>212</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM11</name><description>ADC12 Conversion Memory 11</description><addressOffset>214</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM12</name><description>ADC12 Conversion Memory 12</description><addressOffset>216</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM13</name><description>ADC12 Conversion Memory 13</description><addressOffset>218</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM14</name><description>ADC12 Conversion Memory 14</description><addressOffset>220</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12MEM15</name><description>ADC12 Conversion Memory 15</description><addressOffset>222</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>ADC12CTL0</name><description>ADC12 Control 0</description><addressOffset>288</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADC12SC</name><description>ADC12 Start Conversion</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ENC</name><description>ADC12 Enable Conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC12TOVIE</name><description>ADC12 Timer Overflow interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC12OVIE</name><description>ADC12 Overflow interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC12ON</name><description>ADC12 On/enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>REFON</name><description>ADC12 Reference on</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>REF2_5V</name><description>ADC12 Ref 0:1.5V / 1:2.5V</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSC</name><description>ADC12 Multiple SampleConversion</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SHT0</name><description>ADC12 Sample Hold 0 Select 0</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SHT0_0</name><description>ADC12 Sample Hold 0 Select Bit: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SHT0_1</name><description>ADC12 Sample Hold 0 Select Bit: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SHT0_2</name><description>ADC12 Sample Hold 0 Select Bit: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SHT0_3</name><description>ADC12 Sample Hold 0 Select Bit: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SHT0_4</name><description>ADC12 Sample Hold 0 Select Bit: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SHT0_5</name><description>ADC12 Sample Hold 0 Select Bit: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SHT0_6</name><description>ADC12 Sample Hold 0 Select Bit: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SHT0_7</name><description>ADC12 Sample Hold 0 Select Bit: 7</description><value>7</value></enumeratedValue><enumeratedValue><name>SHT0_8</name><description>ADC12 Sample Hold 0 Select Bit: 8</description><value>8</value></enumeratedValue><enumeratedValue><name>SHT0_9</name><description>ADC12 Sample Hold 0 Select Bit: 9</description><value>9</value></enumeratedValue><enumeratedValue><name>SHT0_10</name><description>ADC12 Sample Hold 0 Select Bit: 10</description><value>10</value></enumeratedValue><enumeratedValue><name>SHT0_11</name><description>ADC12 Sample Hold 0 Select Bit: 11</description><value>11</value></enumeratedValue><enumeratedValue><name>SHT0_12</name><description>ADC12 Sample Hold 0 Select Bit: 12</description><value>12</value></enumeratedValue><enumeratedValue><name>SHT0_13</name><description>ADC12 Sample Hold 0 Select Bit: 13</description><value>13</value></enumeratedValue><enumeratedValue><name>SHT0_14</name><description>ADC12 Sample Hold 0 Select Bit: 14</description><value>14</value></enumeratedValue><enumeratedValue><name>SHT0_15</name><description>ADC12 Sample Hold 0 Select Bit: 15</description><value>15</value></enumeratedValue></enumeratedValues></field><field><name>SHT1</name><description>ADC12 Sample Hold 0 Select 0</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>SHT1_0</name><description>ADC12 Sample Hold 1 Select Bit: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>SHT1_1</name><description>ADC12 Sample Hold 1 Select Bit: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>SHT1_2</name><description>ADC12 Sample Hold 1 Select Bit: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SHT1_3</name><description>ADC12 Sample Hold 1 Select Bit: 3</description><value>3</value></enumeratedValue><enumeratedValue><name>SHT1_4</name><description>ADC12 Sample Hold 1 Select Bit: 4</description><value>4</value></enumeratedValue><enumeratedValue><name>SHT1_5</name><description>ADC12 Sample Hold 1 Select Bit: 5</description><value>5</value></enumeratedValue><enumeratedValue><name>SHT1_6</name><description>ADC12 Sample Hold 1 Select Bit: 6</description><value>6</value></enumeratedValue><enumeratedValue><name>SHT1_7</name><description>ADC12 Sample Hold 1 Select Bit: 7</description><value>7</value></enumeratedValue><enumeratedValue><name>SHT1_8</name><description>ADC12 Sample Hold 1 Select Bit: 8</description><value>8</value></enumeratedValue><enumeratedValue><name>SHT1_9</name><description>ADC12 Sample Hold 1 Select Bit: 9</description><value>9</value></enumeratedValue><enumeratedValue><name>SHT1_10</name><description>ADC12 Sample Hold 1 Select Bit: 10</description><value>10</value></enumeratedValue><enumeratedValue><name>SHT1_11</name><description>ADC12 Sample Hold 1 Select Bit: 11</description><value>11</value></enumeratedValue><enumeratedValue><name>SHT1_12</name><description>ADC12 Sample Hold 1 Select Bit: 12</description><value>12</value></enumeratedValue><enumeratedValue><name>SHT1_13</name><description>ADC12 Sample Hold 1 Select Bit: 13</description><value>13</value></enumeratedValue><enumeratedValue><name>SHT1_14</name><description>ADC12 Sample Hold 1 Select Bit: 14</description><value>14</value></enumeratedValue><enumeratedValue><name>SHT1_15</name><description>ADC12 Sample Hold 1 Select Bit: 15</description><value>15</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>ADC12CTL1</name><description>ADC12 Control 1</description><addressOffset>290</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>ADC12BUSY</name><description>ADC12 Busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CONSEQ</name><description>ADC12 Conversion Sequence Select 0</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CONSEQ_0</name><description>ADC12 Conversion Sequence Select: 0</description><value>0</value></enumeratedValue><enumeratedValue><name>CONSEQ_1</name><description>ADC12 Conversion Sequence Select: 1</description><value>1</value></enumeratedValue><enumeratedValue><name>CONSEQ_2</name><description>ADC12 Conversion Sequence Select: 2</description><value>2</value></enumeratedValue><enumeratedValue><name>CONSEQ_3</name><description>ADC12 Conversion Sequence Select: 3</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ADC12SSEL</name><description>ADC12 Clock Source Select 0</description><bitOffset>3</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ADC12SSEL_0</name><description>ADC12 Clock Source Select: 0</description><value>0</value></enumerated