bdshields/mini_tetris/msp430f1611.svd
ister><register><name>TBCCTL3</name><description>Timer B Capture/Compare Control 3</description><addressOffset>106</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLLD</name><description>Compare latch load source 1</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CLLD_0</name><description>Compare latch load sourec : 0 - immediate</description><value>0</value></enumeratedValue><enumeratedValue><name>CLLD_1</name><description>Compare latch load sourec : 1 - TBR counts to 0</description><value>1</value></enumeratedValue><enumeratedValue><name>CLLD_2</name><description>Compare latch load sourec : 2 - up/down</description><value>2</value></enumeratedValue><enumeratedValue><name>CLLD_3</name><description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TBCCTL4</name><description>Timer B Capture/Compare Control 4</description><addressOffset>108</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLLD</name><description>Compare latch load source 1</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CLLD_0</name><description>Compare latch load sourec : 0 - immediate</description><value>0</value></enumeratedValue><enumeratedValue><name>CLLD_1</name><description>Compare latch load sourec : 1 - TBR counts to 0</description><value>1</value></enumeratedValue><enumeratedValue><name>CLLD_2</name><description>Compare latch load sourec : 2 - up/down</description><value>2</value></enumeratedValue><enumeratedValue><name>CLLD_3</name><description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TBCCTL5</name><description>Timer B Capture/Compare Control 5</description><addressOffset>110</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLLD</name><description>Compare latch load source 1</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CLLD_0</name><description>Compare latch load sourec : 0 - immediate</description><value>0</value></enumeratedValue><enumeratedValue><name>CLLD_1</name><description>Compare latch load sourec : 1 - TBR counts to 0</description><value>1</value></enumeratedValue><enumeratedValue><name>CLLD_2</name><description>Compare latch load sourec : 2 - up/down</description><value>2</value></enumeratedValue><enumeratedValue><name>CLLD_3</name><description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TBCCTL6</name><description>Timer B Capture/Compare Control 6</description><addressOffset>112</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CLLD</name><description>Compare latch load source 1</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CLLD_0</name><description>Compare latch load sourec : 0 - immediate</description><value>0</value></enumeratedValue><enumeratedValue><name>CLLD_1</name><description>Compare latch load sourec : 1 - TBR counts to 0</description><value>1</value></enumeratedValue><enumeratedValue><name>CLLD_2</name><description>Compare latch load sourec : 2 - up/down</description><value>2</value></enumeratedValue><enumeratedValue><name>CLLD_3</name><description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TBR</name><description>Timer B Counter Register</description><addressOffset>114</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR0</name><description>Timer B Capture/Compare 0</description><addressOffset>116</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR1</name><description>Timer B Capture/Compare 1</description><addressOffset>118</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR2</name><description>Timer B Capture/Compare 2</description><addressOffset>120</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR3</name><description>Timer B Capture/Compare 3</description><addressOffset>122</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR4</name><description>Timer B Capture/Compare 4</description><addressOffset>124</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR5</name><description>Timer B Capture/Compare 5</description><addressOffset>126</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TBCCR6</name><description>Timer B Capture/Compare 6</description><addressOffset>128</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>WATCHDOG_TIMER</name><description>Watchdog Timer</description><baseAddress>288</baseAddress><registers><register><name>WDTCTL</name><description>Watchdog Timer Control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>WDTIS0</name><description>WDTIS0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTIS1</name><description>WDTIS1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTSSEL</name><description>WDTSSEL</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTCNTCL</name><description>WDTCNTCL</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTTMSEL</name><description>WDTTMSEL</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTNMI</name><description>WDTNMI</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTNMIES</name><description>WDTNMIES</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDTHOLD</name><description>WDTHOLD</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>DMA</name><description>DMA</description><baseAddress>290</baseAddress><registers><register><name>DMACTL0</name><description>DMA Module Control 0</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DMA0TSEL</name><description>DMA channel 0 transfer select bit 0</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DMA0TSEL_0</name><description>DMA channel 0 transfer select 0:  DMA_REQ (sw)</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_1</name><description>DMA channel 0 transfer select 1:  Timer_A (TACCR2.IFG)</description><value>1</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_2</name><description>DMA channel 0 transfer select 2:  Timer_B (TBCCR2.IFG)</description><value>2</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_3</name><description>DMA channel 0 transfer select 3:  UART0/I2C receive</description><value>3</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_4</name><description>DMA channel 0 transfer select 4:  UART0/I2C transmit</description><value>4</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_5</name><description>DMA channel 0 transfer select 5:  DAC12_0CTL.DAC12IFG</description><value>5</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_6</name><description>DMA channel 0 transfer select 6:  ADC12 (ADC12IFG)</description><value>6</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_7</name><description>DMA channel 0 transfer select 7:  Timer_A (TACCR0.IFG)</description><value>7</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_8</name><description>DMA channel 0 transfer select 8:  Timer_B (TBCCR0.IFG)</description><value>8</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_9</name><description>DMA channel 0 transfer select 9:  UART1 receive</description><value>9</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_10</name><description>DMA channel 0 transfer select 10: UART1 transmit</description><value>10</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_11</name><description>DMA channel 0 transfer select 11: Multiplier ready</description><value>11</value></enumeratedValue><enumeratedValue><name>DMA0TSEL_14</name><description>DMA channel 0 transfer select 14: previous DMA channel DMA2IFG</description><value>14</value></enumeratedValue><enumeratedValue