bdshields/mini_tetris/msp430f1611.svd
<name>TIMER_A3</name><description>Timer A3</description><baseAddress>302</baseAddress><registers><register><name>TAIV</name><description>Timer A Interrupt Vector Word</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TACTL</name><description>Timer A Control</description><addressOffset>50</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>TAIFG</name><description>Timer A counter interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TAIE</name><description>Timer A counter interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TACLR</name><description>Timer A counter clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MC</name><description>Timer A mode control 1</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>MC_0</name><description>Timer A mode control: 0 - Stop</description><value>0</value></enumeratedValue><enumeratedValue><name>MC_1</name><description>Timer A mode control: 1 - Up to CCR0</description><value>1</value></enumeratedValue><enumeratedValue><name>MC_2</name><description>Timer A mode control: 2 - Continous up</description><value>2</value></enumeratedValue><enumeratedValue><name>MC_3</name><description>Timer A mode control: 3 - Up/Down</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>ID</name><description>Timer A clock input divider 1</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>ID_0</name><description>Timer A input divider: 0 - /1</description><value>0</value></enumeratedValue><enumeratedValue><name>ID_1</name><description>Timer A input divider: 1 - /2</description><value>1</value></enumeratedValue><enumeratedValue><name>ID_2</name><description>Timer A input divider: 2 - /4</description><value>2</value></enumeratedValue><enumeratedValue><name>ID_3</name><description>Timer A input divider: 3 - /8</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>TASSEL</name><description>Timer A clock source select 1</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>TASSEL_0</name><description>Timer A clock source select: 0 - TACLK</description><value>0</value></enumeratedValue><enumeratedValue><name>TASSEL_1</name><description>Timer A clock source select: 1 - ACLK</description><value>1</value></enumeratedValue><enumeratedValue><name>TASSEL_2</name><description>Timer A clock source select: 2 - SMCLK</description><value>2</value></enumeratedValue><enumeratedValue><name>TASSEL_3</name><description>Timer A clock source select: 3 - INCLK</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TACCTL0</name><description>Timer A Capture/Compare Control 0</description><addressOffset>52</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TACCTL1</name><description>Timer A Capture/Compare Control 1</description><addressOffset>54</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TACCTL2</name><description>Timer A Capture/Compare Control 2</description><addressOffset>56</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>CCIFG</name><description>Capture/compare interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COV</name><description>Capture/compare overflow flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUT</name><description>PWM Output signal if output mode 0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCI</name><description>Capture input signal (read)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIE</name><description>Capture/compare interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTMOD</name><description>Output mode 2</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>OUTMOD_0</name><description>PWM output mode: 0 - output only</description><value>0</value></enumeratedValue><enumeratedValue><name>OUTMOD_1</name><description>PWM output mode: 1 - set</description><value>1</value></enumeratedValue><enumeratedValue><name>OUTMOD_2</name><description>PWM output mode: 2 - PWM toggle/reset</description><value>2</value></enumeratedValue><enumeratedValue><name>OUTMOD_3</name><description>PWM output mode: 3 - PWM set/reset</description><value>3</value></enumeratedValue><enumeratedValue><name>OUTMOD_4</name><description>PWM output mode: 4 - toggle</description><value>4</value></enumeratedValue><enumeratedValue><name>OUTMOD_5</name><description>PWM output mode: 5 - Reset</description><value>5</value></enumeratedValue><enumeratedValue><name>OUTMOD_6</name><description>PWM output mode: 6 - PWM toggle/set</description><value>6</value></enumeratedValue><enumeratedValue><name>OUTMOD_7</name><description>PWM output mode: 7 - PWM reset/set</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>CAP</name><description>Capture mode: 1 /Compare mode : 0</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCCI</name><description>Latched capture signal (read)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SCS</name><description>Capture sychronize</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CCIS</name><description>Capture input select 1</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CCIS_0</name><description>Capture input select: 0 - CCIxA</description><value>0</value></enumeratedValue><enumeratedValue><name>CCIS_1</name><description>Capture input select: 1 - CCIxB</description><value>1</value></enumeratedValue><enumeratedValue><name>CCIS_2</name><description>Capture input select: 2 - GND</description><value>2</value></enumeratedValue><enumeratedValue><name>CCIS_3</name><description>Capture input select: 3 - Vcc</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>CM</name><description>Capture mode 1</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>CM_0</name><description>Capture mode: 0 - disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>CM_1</name><description>Capture mode: 1 - pos. edge</description><value>1</value></enumeratedValue><enumeratedValue><name>CM_2</name><description>Capture mode: 1 - neg. edge</description><value>2</value></enumeratedValue><enumeratedValue><name>CM_3</name><description>Capture mode: 1 - both edges</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>TAR</name><description>Timer A Counter Register</description><addressOffset>66</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TACCR0</name><description>Timer A Capture/Compare 0</description><addressOffset>68</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TACCR1</name><description>Timer A Capture/Compare 1</description><addressOffset>70</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>TACCR2</name><description>Timer A Capture/Compare 2</description><addressOffset>72</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>MULTIPLIER</name><description>Multiplier</description><baseAddress>304</baseAddress><registers><register><name>MPY</name><description>Multiply Unsigned/Operand 1</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MPYS</name><description>Multiply Signed/Operand 1</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MAC</name><description>Multiply Unsigned and Accumulate/Operand 1</description><addressOffset>4</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>MACS</name><description>Multiply Signed and Accumulate/Operand 1</description><addressOffset>6</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>OP2</name><description>Operand 2</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RESLO</name><description>Result Low Word</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>RESHI</name><description>Result High Word</description><addressOffset>12</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>SUMEXT</name><description>Sum Extend</description><addressOffset>14</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>DAC12</name><description>DAC12</description><baseAddress>448</baseAddress><registers><register><name>DAC12_0CTL</name><description>DAC12_0 Control</description><addressOffset>0</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DAC12GRP</name><description>DAC12 group</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12ENC</name><description>DAC12 enable conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12IFG</name><description>DAC12 interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12IE</name><description>DAC12 interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12DF</name><description>DAC12 data format</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12AMP</name><description>DAC12 amplifier bit 0</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12AMP_0</name><description>DAC12 amplifier 0: off</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12AMP_1</name><description>DAC12 amplifier 1: off</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12AMP_2</name><description>DAC12 amplifier 2: low</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12AMP_3</name><description>DAC12 amplifier 3: low</description><value>3</value></enumeratedValue><enumeratedValue><name>DAC12AMP_4</name><description>DAC12 amplifier 4: low</description><value>4</value></enumeratedValue><enumeratedValue><name>DAC12AMP_5</name><description>DAC12 amplifier 5: medium</description><value>5</value></enumeratedValue><enumeratedValue><name>DAC12AMP_6</name><description>DAC12 amplifier 6: medium</description><value>6</value></enumeratedValue><enumeratedValue><name>DAC12AMP_7</name><description>DAC12 amplifier 7: high</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>DAC12IR</name><description>DAC12 input reference and output range</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12CALON</name><description>DAC12 calibration</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12LSEL</name><description>DAC12 load select bit 0</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12LSEL_0</name><description>DAC12 load select 0: direct</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_1</name><description>DAC12 load select 1: latched with DAT</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_2</name><description>DAC12 load select 2: latched with pos. Timer_A3.OUT1</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_3</name><description>DAC12 load select 3: latched with pos. Timer_B7.OUT1</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>DAC12RES</name><description>DAC12 resolution</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12SREF</name><description>DAC12 reference bit 0</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12SREF_0</name><description>DAC12 reference 0: Vref+</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12SREF_1</name><description>DAC12 reference 1: Vref+</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12SREF_2</name><description>DAC12 reference 2: Veref+</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12SREF_3</name><description>DAC12 reference 3: Veref+</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>DAC12_1CTL</name><description>DAC12_1 Control</description><addressOffset>2</addressOffset><size>16</size><resetMask>65535</resetMask><fields><field><name>DAC12GRP</name><description>DAC12 group</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12ENC</name><description>DAC12 enable conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12IFG</name><description>DAC12 interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12IE</name><description>DAC12 interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12DF</name><description>DAC12 data format</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12AMP</name><description>DAC12 amplifier bit 0</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12AMP_0</name><description>DAC12 amplifier 0: off</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12AMP_1</name><description>DAC12 amplifier 1: off</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12AMP_2</name><description>DAC12 amplifier 2: low</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12AMP_3</name><description>DAC12 amplifier 3: low</description><value>3</value></enumeratedValue><enumeratedValue><name>DAC12AMP_4</name><description>DAC12 amplifier 4: low</description><value>4</value></enumeratedValue><enumeratedValue><name>DAC12AMP_5</name><description>DAC12 amplifier 5: medium</description><value>5</value></enumeratedValue><enumeratedValue><name>DAC12AMP_6</name><description>DAC12 amplifier 6: medium</description><value>6</value></enumeratedValue><enumeratedValue><name>DAC12AMP_7</name><description>DAC12 amplifier 7: high</description><value>7</value></enumeratedValue></enumeratedValues></field><field><name>DAC12IR</name><description>DAC12 input reference and output range</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12CALON</name><description>DAC12 calibration</description><bitOffset>9</b