bdshields/mini_tetris/msp430f1611.svd
itOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12LSEL</name><description>DAC12 load select bit 0</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12LSEL_0</name><description>DAC12 load select 0: direct</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_1</name><description>DAC12 load select 1: latched with DAT</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_2</name><description>DAC12 load select 2: latched with pos. Timer_A3.OUT1</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12LSEL_3</name><description>DAC12 load select 3: latched with pos. Timer_B7.OUT1</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>DAC12RES</name><description>DAC12 resolution</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DAC12SREF</name><description>DAC12 reference bit 0</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><enumeratedValue><name>DAC12SREF_0</name><description>DAC12 reference 0: Vref+</description><value>0</value></enumeratedValue><enumeratedValue><name>DAC12SREF_1</name><description>DAC12 reference 1: Vref+</description><value>1</value></enumeratedValue><enumeratedValue><name>DAC12SREF_2</name><description>DAC12 reference 2: Veref+</description><value>2</value></enumeratedValue><enumeratedValue><name>DAC12SREF_3</name><description>DAC12 reference 3: Veref+</description><value>3</value></enumeratedValue></enumeratedValues></field></fields></register><register><name>DAC12_0DAT</name><description>DAC12_0 Data</description><addressOffset>8</addressOffset><size>16</size><resetMask>65535</resetMask></register><register><name>DAC12_1DAT</name><description>DAC12_1 Data</description><addressOffset>10</addressOffset><size>16</size><resetMask>65535</resetMask></register></registers></peripheral><peripheral><name>_INTERRUPTS</name><baseAddress>65504</baseAddress><interrupt><name>DACDMA</name><description>0xFFE0 DAC/DMA</description><value>0</value></interrupt><interrupt><name>PORT2</name><description>0xFFE2 Port 2</description><value>1</value></interrupt><interrupt><name>USART1TX</name><description>0xFFE4 USART 1 Transmit</description><value>2</value></interrupt><interrupt><name>USART1RX</name><description>0xFFE6 USART 1 Receive</description><value>3</value></interrupt><interrupt><name>PORT1</name><description>0xFFE8 Port 1</description><value>4</value></interrupt><interrupt><name>TIMERA1</name><description>0xFFEA Timer A CC1-2, TA</description><value>5</value></interrupt><interrupt><name>TIMERA0</name><description>0xFFEC Timer A CC0</description><value>6</value></interrupt><interrupt><name>ADC12</name><description>0xFFEE ADC</description><value>7</value></interrupt><interrupt><name>USART0TX</name><description>0xFFF0 USART 0 Transmit</description><value>8</value></interrupt><interrupt><name>USART0RX</name><description>0xFFF2 USART 0 Receive</description><value>9</value></interrupt><interrupt><name>WDT</name><description>0xFFF4 Watchdog Timer</description><value>10</value></interrupt><interrupt><name>COMPARATORA</name><description>0xFFF6 Comparator A</description><value>11</value></interrupt><interrupt><name>TIMERB1</name><description>0xFFF8 Timer B CC1-6, TB</description><value>12</value></interrupt><interrupt><name>TIMERB0</name><description>0xFFFA Timer B CC0</description><value>13</value></interrupt><interrupt><name>NMI</name><description>0xFFFC Non-maskable</description><value>14</value></interrupt></peripheral></peripherals><vendorExtensions><msp430_svd><version>0.3.0</version><commit_hash>8881b44</commit_hash></msp430_svd></vendorExtensions></device>
